class GoDict:
    pass

    @classmethod
    def print_info(cls):
        a = "Выбор действия:\n1 - добавление данных\n2 - удаление данных\n3 - поиск данных\n" \
            "4 - редактирование данных\n5 - сохранение данных\n6 - просмотр данных"
        print(a)
        b = input("Введите код действия: ")
        return b


guide = {
    "Росиия": "Москва",
    "Англия": "Лондон",
    "Испания": "Мадрид",
    "Франция": "Париж",
    "Германия": "Берлин",
    "Италия": "Рим",
    "Белорусь": "Минск"
}

d1 = GoDict()
d1.print_info()
