#    *******************************    Первое задание

a = input("What is your name? ")
b = input("How old are you? ")
c = input("Where are you live? ")
print("This is", a)
print("It is", b, "years")
print("He lives in", c)

#    *******************************    Второе задание

# a = int(input("Решите пример: 4 * 100 - 54? \nВаш товет: "))
# if a == 346:
#     print("Вы выиграли! Правильный ответ: 346\nВаш ответ:", a)
# else:
#     print("Правильный ответ: 346\nВаш ответ:", a, "\nПопробуйте ещё раз")

#    *******************************    Третье задание

# a = int(input("Введите целое число: "))
# if a % 2 == 0:
#     print("Число чётное")
# else:
#     print("Число не чётное")